api/spec/fixtures/stripe/2025-04-30.basil/payment_intent_card_declined_response.json

{
  "error": {
    "advice_code": "try_again_later",
    "charge": "ch_3RWJu0Q8iJWBZFaM2XNS6uiT",
    "code": "card_declined",
    "decline_code": "generic_decline",
    "doc_url": "https://stripe.com/docs/error-codes/card-declined",
    "message": "Your card was declined.",
    "payment_intent": {
      "id": "pi_3RWJu0Q8iJWBZFaM2S1rzYRV",
      "object": "payment_intent",
      "amount": 4620,
      "amount_capturable": 0,
      "amount_details": {
        "tip": {}
      },
      "amount_received": 0,
      "application": null,
      "application_fee_amount": null,
      "automatic_payment_methods": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic_async",
      "client_secret": "pi_3R**********************_******_*********************bifg",
      "confirmation_method": "automatic",
      "created": 1749053456,
      "currency": "eur",
      "customer": "cus_SRCIP043oBsNpV",
      "description": "Hamill and Sons - Invoice HAM-4D33-001-001",
      "last_payment_error": {
        "advice_code": "try_again_later",
        "charge": "ch_3RWJu0Q8iJWBZFaM2XNS6uiT",
        "code": "card_declined",
        "decline_code": "generic_decline",
        "doc_url": "https://stripe.com/docs/error-codes/card-declined",
        "message": "Your card was declined.",
        "payment_method": {
          "id": "pm_1RWJtyQ8iJWBZFaM7VUymbOi",
          "object": "payment_method",
          "allow_redisplay": "unspecified",
          "billing_details": {
            "address": {
              "city": null,
              "country": null,
              "line1": null,
              "line2": null,
              "postal_code": null,
              "state": null
            },
            "email": null,
            "name": null,
            "phone": null,
            "tax_id": null
          },
          "card": {
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": null,
              "cvc_check": "pass"
            },
            "country": "US",
            "display_brand": "visa",
            "exp_month": 6,
            "exp_year": 2026,
            "fingerprint": "pmIfA8TCefcd72yD",
            "funding": "credit",
            "generated_from": null,
            "last4": "0341",
            "networks": {
              "available": [
                "visa"
              ],
              "preferred": null
            },
            "regulated_status": "unregulated",
            "three_d_secure_usage": {
              "supported": true
            },
            "wallet": null
          },
          "created": 1749053454,
          "customer": "cus_SRCIP043oBsNpV",
          "livemode": false,
          "metadata": {},
          "type": "card"
        },
        "type": "card_error"
      },
      "latest_charge": "ch_3RWJu0Q8iJWBZFaM2XNS6uiT",
      "livemode": false,
      "metadata": {
        "invoice_type": "one_off",
        "lago_customer_id": "6905cdff-e814-4b11-bfd0-354c9c892a14",
        "lago_payment_id": "f479e061-3d72-422a-9cbf-c2231d1dc22e",
        "lago_payable_type": "Invoice",
        "lago_billing_entity_id": "fd82eee2-ae1e-453e-8170-cfc371db4d33",
        "lago_payable_id": "5d61b290-4b8f-433e-ad83-575d74eb89ad",
        "invoice_issuing_date": "2025-06-04",
        "lago_invoice_id": "5d61b290-4b8f-433e-ad83-575d74eb89ad",
        "lago_organization_id": "fb73459d-9e7f-4f22-859f-06fc4751cc06"
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": null,
      "payment_method_configuration_details": null,
      "payment_method_options": {
        "card": {
          "installments": null,
          "mandate_options": null,
          "network": null,
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": [
        "card"
      ],
      "processing": null,
      "receipt_email": null,
      "review": null,
      "setup_future_usage": null,
      "shipping": null,
      "source": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "requires_payment_method",
      "transfer_data": null,
      "transfer_group": null
    },
    "payment_method": {
      "id": "pm_1RWJtyQ8iJWBZFaM7VUymbOi",
      "object": "payment_method",
      "allow_redisplay": "unspecified",
      "billing_details": {
        "address": {
          "city": null,
          "country": null,
          "line1": null,
          "line2": null,
          "postal_code": null,
          "state": null
        },
        "email": null,
        "name": null,
        "phone": null,
        "tax_id": null
      },
      "card": {
        "brand": "visa",
        "checks": {
          "address_line1_check": null,
          "address_postal_code_check": null,
          "cvc_check": "pass"
        },
        "country": "US",
        "display_brand": "visa",
        "exp_month": 6,
        "exp_year": 2026,
        "fingerprint": "pmIfA8TCefcd72yD",
        "funding": "credit",
        "generated_from": null,
        "last4": "0341",
        "networks": {
          "available": [
            "visa"
          ],
          "preferred": null
        },
        "regulated_status": "unregulated",
        "three_d_secure_usage": {
          "supported": true
        },
        "wallet": null
      },
      "created": 1749053454,
      "customer": "cus_SRCIP043oBsNpV",
      "livemode": false,
      "metadata": {},
      "type": "card"
    },
    "request_log_url": "https://dashboard.stripe.com/test/logs/req_Mnze9i9NwAxolD?t=1749053456",
    "type": "card_error"
  }
}
