api/spec/fixtures/stripe/2025-04-30.basil/payment_intent_requires_action_response.json

{
  "id": "pi_3SUpkBQ8iJWBZFaM0SuylvJC",
  "object": "payment_intent",
  "amount": 1343333,
  "amount_capturable": 0,
  "amount_details": {
    "tip": {}
  },
  "amount_received": 0,
  "application": null,
  "application_fee_amount": null,
  "automatic_payment_methods": null,
  "canceled_at": null,
  "cancellation_reason": null,
  "capture_method": "automatic",
  "charges": {
    "object": "list",
    "data": [],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/charges?payment_intent=pi_3SUpkBQ8iJWBZFaM0SuylvJC"
  },
  "client_secret": "pi_3S**********************_******_*********************GpAp",
  "confirmation_method": "automatic",
  "created": 1763475535,
  "currency": "eur",
  "customer": "cus_TRjC4B0UDzH8K1",
  "description": "VonRueden-Harber - Invoice VON-A4DD-001-002",
  "excluded_payment_method_types": null,
  "invoice": null,
  "last_payment_error": null,
  "latest_charge": null,
  "livemode": false,
  "metadata": {
    "invoice_type": "subscription",
    "lago_customer_id": "98bf77bb-cac2-47c6-a358-41092b25c9f9",
    "lago_payment_id": "1b38a6f4-3170-41a9-b803-9fea9efc48bc",
    "lago_payable_type": "Invoice",
    "lago_billing_entity_id": "c1d5c434-0218-4a98-a23e-66a90e06a4dd",
    "lago_payable_id": "0c5c28cc-f852-4ae1-9eb3-c66f04ed1f7a",
    "invoice_issuing_date": "2025-11-18",
    "lago_invoice_id": "0c5c28cc-f852-4ae1-9eb3-c66f04ed1f7a",
    "lago_organization_id": "3b6eb26a-2fba-4a09-89a1-c8dc35d0d294"
  },
  "next_action": {
    "redirect_to_url": {
      "return_url": "https://app.lago.dev",
      "url": "https://hooks.stripe.com/3d_secure_2/hosted?merchant=acct_1QsO86Q8iJWBZFaM&payment_intent=pi_3SUpkBQ8iJWBZFaM0SuylvJC&payment_intent_client_secret=pi_3SUpkBQ8iJWBZFaM0SuylvJC_secret_bYitZ99s7rl1899EtiJdtGpAp&publishable_key=pk_test_51QsO86Q8iJWBZFaMwtpbKdhk6KBo35c33qoCf4VmWBJsXPuFQHsPxOW7vYLoWWNTZ6OeRHOTZCvndlERhCwTQuxk008fi0Py0N&source=payatt_3SUpkBQ8iJWBZFaM03X7Tpiy"
    },
    "type": "redirect_to_url"
  },
  "on_behalf_of": null,
  "payment_method": "pm_1SUpk3Q8iJWBZFaMdTZGqSKL",
  "payment_method_configuration_details": null,
  "payment_method_options": {
    "card": {
      "installments": null,
      "mandate_options": null,
      "network": null,
      "request_three_d_secure": "automatic"
    }
  },
  "payment_method_types": [
    "card"
  ],
  "processing": null,
  "receipt_email": null,
  "review": null,
  "setup_future_usage": null,
  "shipping": null,
  "source": null,
  "statement_descriptor": null,
  "statement_descriptor_suffix": null,
  "status": "requires_action",
  "transfer_data": null,
  "transfer_group": null
}
